#include <stdio.h>
#include <stdlib.h>
#include <math.h>

/*関数の設定-------------------------------------------------------------------------------*/
double f(double x){
  return cos(x)+x;
  }
/*-----------------------------------------------------------------------------------------*/
void dichotomy(void); //計算部分の宣言

/*メイン関数-------------------------------------------------------------------------------*/
int main(void){
  
  dichotomy();

  return 0;
}
/*-----------------------------------------------------------------------------------------*/

/*二分法の計算-----------------------------------------------------------------------------*/
void dichotomy(void){
  int count = 0;
  double a, b, c;

  while(1){
    printf("初期値a,bを入力\n");
    printf("a = ");
    scanf("%lf", &a);
    printf("b = ");
    scanf("%lf", &b);

    if(f(a)*f(b) > 0){
      printf("初期値の設定が悪い\n");
      break;
    }

    while(1){
      count++;
      c = (a + b) / 2;
      if(f(c)*f(a) < 0){
        b = c;
      }else{
        a = c;
      }

      if(fabs(a-b)<0.0000000000001){
        printf("x = %lfで収束\n", c);
        exit(1);
        }else if(count == 1000){
        printf("収束しませんでした\n");
        exit(1);
      }
    }
  }
}
/*------------------------------------------------------------------------------------------*/

  
